{
  "status": true,
  "creator": "Aliya Khan",
  "result": {
    "tafsir": "Allah is God Almighty, there is no god but Him, and only He has the right to be worshiped. As for the other gods that some people worship for incorrect reasons, there are indeed many of them. However, the real God is only Allah. Only He is the eternal life, who exists by Himself, and He is also the one who always manages His creatures without the slightest negligence.\n\nThen it is emphasized again that Allah is never sleepy. A person who is in a sleepy state of course loses consciousness, so he will not be able to do his job properly, even though Allah always takes good care of and takes care of His creatures, never loses consciousness or is negligent. \n\nBecause Allah is never sleepy, of course He never sleeps, because drowsiness is the beginning of the sleep process.A sleeping person loses consciousness more than a sleepy person.\n\nAnother attribute of Allah mentioned in this verse is that He is the one who has power and has what is in the heavens and on earth. It is He who has unlimited strength and power, so that He can do whatever He wants. Everything is in His power, so that none of His creatures including the prophets and angels can provide help except with His permission, let alone the statues that the disbelievers consider to be their helpers.\n\ n What is meant by help or intercession in this verse is the help given by angels, prophets and pious people to mankind on the Day of Resurrection to obtain relief or freedom from Allah's punishment. The intercession will occur by Allah's permission.In the hadith it is stated:\n\nThe Prophet said, \"¦Then Allah said, \"The Angels provide intercession, the Prophets provide intercession, and the believers also provide intercession. (Ahmad and Muslim's history from Abu Sa'id al-Khudri)\n\nAnother characteristic of Allah mentioned in this verse is: that Allah always knows what is happening before and behind His creatures, while they do not know anything anything from Allah's knowledge, but only what He wants them to know. Allah's chair covers the heavens and the earth. Allah does not feel the slightest burden in caring for His creatures in the heavens and on earth, and in all of His creation. Allah is Most High, Most Great.\n\nThey do not know Allah's knowledge, except what He has willed for them to know. Thus, what humans can know is only what can be reached by the knowledge that Allah has bestowed upon them, and the amount is very small compared to His extensive knowledge. This is emphasized by Allah in His word:\n\n\"¦ While you are given only a little knowledge.\" (al-Isra'/17:85)",
    "translation": "Allah, there is no god but Him. The Living One, Who continuously takes care of (His creatures), neither drowsy nor sleeps. To Him belongs what is in the heavens and what is on the earth. No one can intercede with Him without His permission. He knows what is before them and what is behind them, and they know nothing of His knowledge except what He wills. His seat covers the heavens and the earth. And He does not feel burdened to maintain them both, and He is High, Great.",
    "arabic": "اَللّٰهُ لَآ اِلٰهَ اِلَّا هُوَۚ اَلْحَيُّ الْقَيُّوْمُ ەۚ لَا تَأْخُذُهٗ سِنَةٌ وَّلَا نَوْمٌۗ  لَهٗ مَا فِى السَّمٰوٰتِ وَمَا فِى الْاَرْضِۗ مَنْ ذَا الَّذِيْ يَشْفَعُ عِنْدَهٗٓ اِلَّا بِاِذْنِهٖۗ يَعْلَمُ مَا بَيْنَ اَيْدِيْهِمْ وَمَا خَلْفَهُمْۚ وَلَا يُحِيْطُوْنَ بِشَيْءٍ مِّنْ عِلْمِهٖٓ اِلَّا بِمَا شَاۤءَۚ وَسِعَ كُرْسِيُّهُ السَّمٰوٰتِ وَالْاَرْضَۚ وَلَا يَـُٔوْدُهٗ حِفْظُهُمَاۚ وَهُوَ الْعَلِيُّ الْعَظِيْمُ",
    "Urdu": "اللہ کے سوا کوئی معبود نہیں وہ زندہ اور ہمیشہ رہنے والا ہے، اسے نہ نیند آتی ہے اور نہ نیند، اسی کا ہے جو کچھ آسمانوں میں ہے اور جو کچھ زمین میں ہے، اس کی اجازت سے ہے، وہ جانتا ہے کہ کیا ہے ان کے ہاتھوں کے درمیان اور جو ان کے پیچھے ہے، اور وہ اس کے علم میں سے کسی چیز کا احاطہ نہیں کرتے، اس کا تخت آسمان اور زمین ہے، اور وہ ان کی حفاظت کرنا نہیں چاہتا، اور وہ سب سے بلند اور عظیم ہے۔"
  }
}
