{
  "status": true,
  "creator": "Anup Kumar",
  "result": [
    {
      "id": 1,
      "name": "Morning Prayer Intention",
      "arabic": "اُصَلِّى فَرْضَ الصُّبْحِ رَكْعَتَيْنِ مُسْتَقْبِلَ الْقِبْلَةِ اَدَاءً ِللهِ تَعَالَى",
      "urdu": "میں صبح کی فرض نماز دو رکعت قبلہ کی طرف اللہ تعالیٰ کے حضور ادا کرتا ہوں",
      "english": "I pray the obligatory morning prayer with two rak'ahs facing the qiblah as a performance to God Almighty"
    },
    {
      "id": 2,
      "name": "The intention of the midday prayer",
      "arabic": "اُصَلِّى فَرْضَ الظُّهْرِاَرْبَعَ رَكَعَاتٍ مُسْتَقْبِلَ الْقِبْلَةِ اَدَاءً ِللهِ تَعَالَى",
      "urdu": "میں ظہر کی نماز چار رکعت قبلہ رخ کر کے پڑھتا ہوں، یہ اللہ تعالیٰ کے لیے ایک عمل ہے",
      "english": "I pray the Zuhr prayer with four rak'ahs facing the qiblah, a performance for God Almighty"
    },
    {
      "id": 3,
      "name": "Intention of Asr Prayer",
      "arabic": "اُصَلِّى فَرْضَ الْعَصْرِاَرْبَعَ رَكَعَاتٍ مُسْتَقْبِلَ الْقِبْلَةِ اَدَاءً ِللهِ تَعَالَى",
      "urdu": "میں ظہر کی نماز چار رکعت قبلہ رخ کر کے پڑھتا ہوں، یہ اللہ تعالیٰ کے لیے ایک عمل ہے",
      "english": "I pray the afternoon prayer with four rak'ahs facing the qiblah, a performance for God Almighty"
    },
    {
      "id": 4,
      "name": "Maghrib prayer intention",
      "arabic": "اُصَلِّى فَرْضَ الْمَغْرِبِ ثَلاَثَ رَكَعَاتٍ مُسْتَقْبِلَ الْقِبْلَةِ اَدَاءً ِللهِ تَعَالَى",
      "urdu": "مغرب کی فرض نماز تین رکعتیں قبلہ رخ ہیں، اللہ تعالیٰ سے دعا",
      "english": "The obligatory prayer of Maghrib is three rak'ahs facing the qiblah, a prayer to God Almighty"
    },
    {
      "id": 5,
      "name": "The intention of the Isya Prayer",
      "arabic": "اُصَلِّى فَرْضَ الْعِشَاءِ اَرْبَعَ رَكَعَاتٍ مُسْتَقْبِلَ الْقِبْلَةِ اَدَاءً ِللهِ تَعَالَى",
      "urdu": "میں فرض شام کا کھانا چار رکعتوں کے ساتھ قبلہ کی طرف اللہ تعالیٰ کی بارگاہ میں پڑھتا ہوں",
      "english": "I pray the obligatory evening meal with four rak'ahs, facing the qiblah, in offering to God Almighty"
    }
  ]
}
